Revit 2027 API
StructuralSettings.GetStructuralSettings Method
 Obtains the StructuralSettings object for the specified project document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static StructuralSettings GetStructuralSettings(
	Document doc
)
Public Shared Function GetStructuralSettings (
	doc As Document
) As StructuralSettings
public:
static StructuralSettings^ GetStructuralSettings(
	Document^ doc
)
static member GetStructuralSettings :
        doc : Document -> StructuralSettings
Parameters
doc Document
 A project document.
Return Value
StructuralSettings
 The StructuralSettings object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace